app/Controllers/Admin/Auth.php

    public function attemptLogin()
    {
        $adminModel = new AdminModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $admin = $adminModel->where('username', $username)->first();
---
SELECT *
FROM `admins`
WHERE `username` = 'admin'
 LIMIT 1