app/Controllers/Admin/Projects.php

SELECT *
FROM `projects`
ORDER BY `sort_order` ASC
---
    public function index()
    {
        $model = new ProjectModel();
        $data['projects'] = $model->orderBy('sort_order', 'ASC')->findAll();

SELECT *
FROM `projects`
WHERE `projects`.`id` = '11'
---
    public function edit($id)
    {
        $model = new ProjectModel();
        $data['project'] = $model->find($id);