app/Controllers/Home.php

    public function index(): string
    {
        $projectModel = new \App\Models\ProjectModel();
        $settingModel = new \App\Models\SettingModel();
        $serviceModel = new \App\Models\ServiceModel();
        $testimonialModel = new \App\Models\TestimonialModel();

        $data = [
            'projects'     => $projectModel->where('is_featured', 1)->orderBy('sort_order', 'ASC')->findAll(),
            'services'     => $serviceModel->findAll(),
            'testimonials' => $testimonialModel->findAll(),
            'settings'     => $settingModel->first(),
            'title'        => 'LOGRAVA STUDIO | Creative Cinematic Storytelling'
        ];
---
SELECT *
FROM `projects`
WHERE `is_featured` = 1
ORDER BY `sort_order` ASC
SELECT *
FROM `services`
SELECT *
FROM `testimonials`
SELECT *
FROM `settings`
 LIMIT 1