app/Controllers/Home.php

SELECT *
FROM `projects`
ORDER BY `sort_order` ASC
---
    public function index(): string
    {
        $projectModel = new ProjectModel();
        $settingModel = new SettingModel();

        $data = [
            'title'    => 'AMBER STUDIO | Creative Cinematic Storytelling',
            'projects' => $projectModel->orderBy('sort_order', 'ASC')->findAll(),
            'settings' => $settingModel->getKeyValuePairs(),
        ];