app/Models/SettingModel.php

    public function getKeyValuePairs()
    {
        $settings = $this->findAll();
---
SELECT *
FROM `settings`